{
  "1st": {
    "name": "1st Year PEM PES",
    "modules": [
      {
        "id": "writing-1",
        "title": "Writing",
        "moduleTitle": "Writing",
        "coefTag": 3,
        "lessons": []
      },
      {
        "id": "ict-1",
        "title": "ICT",
        "moduleTitle": "Information and Communication Technology (ICT)",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "ph-phono-1",
        "title": "Ph & Phono",
        "moduleTitle": "Phonetics and Phonology",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "linguistics-1",
        "title": "Linguistics",
        "moduleTitle": "Linguistics",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "grammar-1",
        "title": "Grammar",
        "moduleTitle": "Grammar",
        "coefTag": 2,
        "lessons": []
      },
      {
        "id": "reading-1",
        "title": "Reading",
        "moduleTitle": "Reading",
        "coefTag": 2,
        "lessons": []
      },
      {
        "id": "culture-1",
        "title": "Culture Studies",
        "moduleTitle": "Culture Studies",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "rtl-arabic-1",
        "title": "لغة عربية",
        "moduleTitle": "لغة عربية",
        "coefTag": 1,
        "lessons": [
        ]    
      }
    ]
  },

  "2nd": {
    "name": "2nd Year PEM PES",
    "modules": [
      {
        "id": "west-civ-lit-2",
        "title": "West. Civ/Lit",
        "moduleTitle": "Western Civilization & Literature",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "grammar-2",
        "title": "Grammar",
        "moduleTitle": "Grammar",
        "coefTag": 2,
        "lessons": []
      },
      {
        "id": "ict-2",
        "title": "ICT",
        "moduleTitle": "Information and Communicatoin Technology",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "rtl-ed-psych-2",
        "title": "علم ن التربوي",
        "moduleTitle": "علم النفس التربوي",
        "coefTag": 1,
        "lessons": [
        ]

      },
      {
        "id": "linguistics-2",
        "title": "Linguistics",
        "moduleTitle": "Linguistics",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "reading-2",
        "title": "Reading",
        "moduleTitle": "Reading",
        "coefTag": 2,
        "lessons": []
      },
      {
        "id": "phonetics-2",
        "title": "Phonetics",
        "moduleTitle": "Phonetics",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "writing-2",
        "title": "Writing",
        "moduleTitle": "Writing",
        "coefTag": 3,
        "lessons": []
      }
    ]
  },

  "3rd": {
    "name": "3rd Year PEM PES",
    "modules": [
      {
        "id": "brit-am-civ-3",
        "title": "Brit/Am Civ.",
        "moduleTitle": "British / American Civilization",
        "aboutModule":"you will study poems and some literary devices + how to write an analysis.<br/>S1 British litterature.<br/>S2 American litterature.",
        "coefTag": 2,
        "lessons": []
      },
      {
        "id": "gr-wr-3",
        "title": "Gr & Wr",
        "moduleTitle": "Grammar and Writing",
        "aboutModule":"you will study poems and some literary devices + how to write an analysis.<br/>S1 British litterature.<br/>S2 American litterature.",
        "coefTag": 3,
        "lessons": []
      },
      {
        "id": "tefl-3",
        "title": "TEFL",
        "moduleTitle": "Teaching English as a Foreign Language (TEFL)",
        "aboutModule":"you will study poems and some literary devices + how to write an analysis.<br/>S1 British litterature.<br/>S2 American litterature.",
        "coefTag": 1,
        "lessons": [
          {
            "title": "An Overview about TEFL",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>Lecture One: An Overview about TEFL</h1> <div class='article-section'> <h2 class='content-h2'>Introducing the Lecture</h2> <p class='text-paragraph'>TEFL is an abbreviation which stands for Teaching English as a Foreign Language. It may be similar to TESOL (Teaching English to Speakers of Other Languages), although the latter is more general as it can include both TESL (Teaching of English as a Second Language) and TEFL. In this vein, TESL (Teaching English as a Second Language) refers to situations in which the English language is taught as a second language to people, students, or learners whose native language is not English.</p> <h2 class='content-h2'>1. Basic Principles of English Language Teaching</h2> <p class='text-paragraph'>English language teaching may uncover a set of principles and sub-principles which are revealed as follow:</p> <ul class='list-standard'> <li class='list-item'><strong>Pedagogy:</strong> Involves classroom management, lesson planning, teaching strategies, techniques, approaches, and materials</li> <li class='list-item'><strong>Linguistics:</strong> It is the study of language, and it has taken ideas from sociology to establish the place and role of language in sociology of human behavior, and from psychology to investigate how language is learned.</li> <li class='list-item'><strong>Psychology:</strong> The study of human behavior</li> </ul> <h2 class='content-h2'>2. Theories and Methods</h2> <p class='text-paragraph'>In the fields of Teaching English as a Foreign Language, there are many basics teaching Methods. They are primarily Structuralism, Constructivism, Behaviorism, Rationalism and Cognitive Psychology, Interactive Approaches, and Computer Assistant Language Learning</p> <p class='text-paragraph'>They might be named as fields of early childhood language acquisition, non-native language pedagogy, language testing, literacy studies, reading processes and instruction, writing bilingualism, reading processes and instruction, translation, pragmatics, discourse analysis, specific languages, lexicology, interpersonal behavior and communication, sociolinguistics, communication strategies, and nonverbal language studies</p> <h3 class='content-h3-decorated'>2.1 Behaviorism and Rationalism Schools (1940s to 1970s)</h3> <h4 class='content-h4-sub'>Behaviorism</h4> <p class='text-paragraph'>According to Skinner, Behaviorism is an important influence on psychology, education, and language teaching, especially in explaining how language is automatically produced by an individual through his/her need to react to a stimulus in daily life. This school argues that there is no need to have an intention or a purpose of creating language, but the language will be naturally evolved through human nature. That is, the language talent should be displayed after a person is born without too much training.</p> <h4 class='content-h4-sub'>Rationalism and Cognitivism</h4> <p class='text-paragraph'>It is not possible human language can be scrutinized merely through stimuli or responses to others. Different from reasons of automatic reaction, experiences, observation or merely accumulation of language in mind, rationalism and cognitive psychology schools argue that humans develop their ability of language through thinking and cognitive ability.</p> <h3 class='content-h3-decorated'>2.2 Constructivism (1980s to 21st century)</h3> <p class='text-paragraph'>The typical themes of the language teaching in this school are mainly interactive discourse, social-cultural variables, cooperative group learning, interlanguage variability, and international approaches. Language learners who are taught through these pedagogies should be fluent and understandable when communicating in English. Constructivist perspectives are manifested through studies of conversational discourse, socio-cultural factors in learning, and integrationist theories. Therefore, the emphasis for practical language application is obvious in this school.</p> <h2 class='content-h2'>3. Teaching Methods in the 19th Century</h2> <p class='text-paragraph'>This methodology is a conventional way that Latin and Greek were taught in Europe. In the 19th century, this methodology started to be applied for teaching French, German, and English. A classical lesson of grammar translation method emphasizes reading proficiency rather than interaction ability. Generally, it might be similar to pedagogies applied in cram-schools in Asia, where preparing for interaction-free standardized tests is regarded as significant. The result might influence the test takers’ future career.</p> <h3 class='content-h3-decorated'>3.1 The Direct Method</h3> <p class='text-paragraph'>Developed in the late 19th century. The use of objects and actions in teaching the meanings of words and language was built up. Spoken language was emphasized. It highlights that language should be taught following the natural principles of first language. The natural communication is more important than formal grammar, and language learners’ errors during interaction can be tolerated. Excessive interruption and correction might obstruct students’ confidence and motivation.</p> <h3 class='content-h3-decorated'>3.2 Audio-lingual Method</h3> <p class='text-paragraph'>This pedagogy emphasizes teaching speaking and listening before reading and writing. It encourages most of the English teaching to use the target language exclusively, helping students immerse and accumulate the knowledge of the target language.</p> <h3 class='content-h3-decorated'>3.3 Learner-centered Method</h3> <p class='text-paragraph'>From 1980s onward, language education based on student cooperation is accentuated. Pair discussion or group brainstorming activities are more significant than teacher-led tutoring. Students actively participate while teachers act as facilitators or advisers. Many methodologies can be conducted through student-centered learning, such as community language learning, silent way, and total physical response.</p> </div> </div>"
          },
          {
            "title": "Management Strategies in the ELT Classroom",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>Lecture Two: Management Strategies in the ELT Classroom</h1> <div class='article-section'> <h2 class='content-h2'>1. What is Classroom Management?</h2> <p class='text-paragraph'>Everything a teacher does to organize students, space, time, and materials so that instruction in content and student learning can take place.</p> <p class='text-paragraph'>If Pilots have flight plans, Coaches have game plans, Executives have business plans, then Effective teachers must have a Classroom Management Action Plan.</p> <h2 class='content-h2'>3. Things that the Students must be aware of in Classroom</h2> <ol class='list-standard'> <li class='list-item'>Discipline (Having a plan)</li> <li class='list-item'>Procedures</li> <li class='list-item'>Routines</li> </ol> <h3 class='content-h3-decorated'>Definitions</h3> <p class='text-paragraph'>1/ Discipline: is about how students behave. It has punishments and rewards.</p> <p class='text-paragraph'>2/ Procedure: is about how things are done. They have no punishments or rewards.</p> <p class='text-paragraph'>3/ Routine: involves what students do automatically (usually). They readily accept a uniform set of classroom procedures because it simplifies their task in succeeding in accomplishing a task. It creates a predictable and consistent environment.</p> <h3 class='content-h3-decorated'>4. Classroom Procedures that MUST become Routines</h3> <ol class='list-standard'> <li class='list-item'>Beginning a class</li> <li class='list-item'>Quieting a Class</li> <li class='list-item'>Student seeking help</li> <li class='list-item'>Actions and reactions of students</li> <li class='list-item'>End of Classroom task</li> </ol> <h3 class='content-h3-decorated'>The Procedure for Teaching Procedures</h3> <ul class='list-standard'> <li class='list-item'><span class='text-highlight'>Explain:</span> State, explain, model, and demonstrate the procedure.</li> <li class='list-item'><span class='text-highlight'>Rehearse:</span> Rehearse and practice the procedure under your supervision. (Obligatory)</li> <li class='list-item'><span class='text-highlight'>Reinforce:</span> Reteach, rehearse, practice, and reinforce the procedure until it becomes a student habit or routine. Give Praise.</li> </ul> <h3 class='content-h3-decorated'>How to Quiet a Classroom?</h3> <ol class='list-standard'> <li class='list-item'>Explain that you will raise your hand or tap a bell and the students are to freeze, turn and face teacher, and be ready for instruction. Model for the students.</li> <li class='list-item'>Rehearse the procedure by having the students visit quietly for a few minutes. Then raise your hand or tap a bell.</li> <li class='list-item'>Reinforce the procedure by correcting any mistakes or giving praise for following procedure. Then rehearse again and again and again.</li> </ol> <h3 class='content-h3-decorated'>Procedures to Rehearse (Examples)</h3> <ul class='list-standard'> <li class='list-item'>Entering the classroom</li> <li class='list-item'>Listening and answering discussion questions</li> <li class='list-item'>Keeping a neat desk</li> <li class='list-item'>Asking questions for understanding</li> <li class='list-item'>Knowing the schedule</li> <li class='list-item'>When you are tardy or absent</li> <li class='list-item'>Turning in papers</li> <li class='list-item'>Heading a paper</li> <li class='list-item'>Coming to attention</li> <li class='list-item'>Walking in the halls</li> <li class='list-item'>Emergency Procedures</li> <li class='list-item'>If your pencil breaks</li> <li class='list-item'>Saying Please and Thank You</li> <li class='list-item'>When you finish early</li> <li class='list-item'>When visitors are in the classroom</li> <li class='list-item'>When a schoolwide announcement is made</li> <li class='list-item'>If you become sick</li> <li class='list-item'>Riding the Bus</li> <li class='list-item'>Going to Lunch</li> <li class='list-item'>Using the Bathroom—1 at a time</li> </ul> <h2 class='content-h2'>5. Classroom Interaction</h2> <ol class='list-standard'> <li class='list-item'>Circle arrangement</li> <li class='list-item'>Oral Skills and activities: <ul class='list-standard'> <li class='list-item'>Increasing students’ speaking abilities through structuring groups</li> <li class='list-item'>Restrict the role of a dominant speaker and perhaps suggest a specific role if appropriate like a chairperson</li> <li class='list-item'>Gaining knowledge, demonstration of understanding, preparation of written work and exploration of ideas</li> <li class='list-item'>Asking questions such as open-ended questions Eg: What do you think about the strike?</li> <li class='list-item'>Allow time for the learners to listen, think, reflect, process their answers and speak</li> <li class='list-item'>Use gestures to replace unnecessary teacher talk</li> <li class='list-item'>If a student is speaking too quietly, help them overcome this intimidity</li> </ul> </li> </ol> <h2 class='content-h2'>6. Feedback</h2> <ul class='list-standard'> <li class='list-item'>The teacher has to get student feedback after each task set; this will provide clear ideas as to whether the students have understood the language item and whether further explanation and practice is required.</li> <li class='list-item'>The teacher should explain difficult items and ensure that learners have adequate understanding before moving on to the next task</li> <li class='list-item'>Students must be encouraged to correct their own work, with making notes in necessary</li> <li class='list-item'>The teacher may simply select different learners to answer questions from the task, or write the answers on the white board.</li> </ul> <h2 class='content-h2'>7. Correcting Errors</h2> <ul class='list-standard'> <li class='list-item'>Asking a question (Example: has this already happened?)</li> <li class='list-item'>The use of gestures and facial expressions (Example: raising one’s hand to indicate the problem)</li> <li class='list-item'>Writing the problem up on the board (for discussion)</li> <li class='list-item'>By repeating the sentence up to the error (Example: The class is -----)</li> <li class='list-item'>By echoing the sentence (Example: He are tall?)</li> <li class='list-item'>By using the phonemic chart (to point out an incorrect sound or pronunciation)</li> <li class='list-item'>By using a concept checking question</li> </ul> <h2 class='content-h2'>8. Group work</h2> <p class='text-paragraph'>In English language teaching, we are usually involved in whole class, individual or pair/group work. Mingling is an activity where the whole class gets up and walks around, as at a party, meeting each other and talking with different people, moving on when they need to.</p> <h2 class='content-h2'>9. Ways of Organizing Pair and Group Work in the Classroom</h2> <ul class='list-standard'> <li class='list-item'>Giving students a number and ask them to remember their numbers, once each student has a number the teacher could say: “Let’s have all the number ones together over here and all the numbers twos over there”</li> <li class='list-item'>If there happens to be an odd number of students, we could make one group of three, as we could at a later stage break them up and put them in pairs with someone else, so they get more chance to speak</li> <li class='list-item'>It is fine to change the partners quite often so that the students don’t get bored with their partner</li> <li class='list-item'>If there is a mixture of talkative and quiet students, put the quieter students together for fluency activities, this will encourage them to talk more and ensures the talkative students do not monopolise the conversation within a mixed group</li> </ul> <h2 class='content-h2'>10. Teaching Materials</h2> <h3 class='content-h3-decorated'>10.1 Non-authentic Materials</h3> <p class='text-paragraph'>The course book is a good material used by teachers for students which is a non-authentic material</p> <h3 class='content-h3-decorated'>10.2 Authentic Materials</h3> <p class='text-paragraph'>These materials are not specifically designed for classroom use, but may be exploited in a language environment, such as: timetables, magazines, emails, letters, newspapers</p> <h3 class='content-h3-decorated'>10.3 Semi-authentic</h3> <p class='text-paragraph'>They may include readers as they are graded for different student levels</p> <h2 class='content-h2'>11. Advantages and Disadvantages</h2> <p class='text-paragraph'>Teaching materials have both advantages and disadvantages which can be summarized as follow.</p> </div> </div>"
          },
          {
            "title": "Teacher-Centeredness Vs. Learner-Centeredness",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>Lecture Three: Teacher-Centeredness Vs. Learner-Centeredness</h1> <div class='article-section'> <p class='text-paragraph'>The first of these is innovative teaching, which has, as its main focus, the manner in which students are best able to learn and which promotes teaching methods which lead them to do so. Innovative teaching is primarily geared towards enhancing students’ critical thinking, thus grooming ‘individuals to become independent lifelong learners’. Cooperative learning is one of many ways used to get students to be responsible for their own learning through a set of methods such as:</p> <ul class='list-standard'> <li class='list-item'>Problem-Based Learning: a method of teaching which enables students to learn more effectively, based on applying the knowledge they gain early during the course of their learning, as students are more exposed to situations they would normally face outside of the classroom and can thus become more adaptable.</li> <li class='list-item'>Student Self-Regulated Learning: This method ensures that students take their own steps in order to learn, and take care of their own monitoring, motivation and feedback process during and after learning through strategies such as: <ul class='list-standard'> <li class='list-item'>Setting specific goals</li> <li class='list-item'>Adopting powerful strategies for attaining these goals</li> <li class='list-item'>Monitoring one’s performance</li> <li class='list-item'>Restructuring one’s learning environment to make it compatible with one’s goals</li> <li class='list-item'>Managing one’s time effectively</li> <li class='list-item'>Self-evaluating one’s methods</li> <li class='list-item'>Attributing results to causation and adapting future methods</li> </ul> </li> </ul> <h2 class='content-h2'>3. Teacher-Centeredness Vs. Learner-Centeredness</h2> <p class='text-paragraph'>Teachers may use different approaches in their teaching and learning process. There are teacher-centered and student-centered approaches. Teacher-centered approach is a traditional approach that uses learning as a product of transmission. Teacher transmits knowledge or information and students are recipients. Student-centered approach is newer, where the learning is a process of discovery. Students develop their ability to use the information the teacher uses and facilitate students’ development of knowledge and skills. Based on the literature on teaching styles, Dupin-Bryant (2004) defines learner-centered teaching style as “a style of instruction that is responsive, collaborative, problem-centered, and democratic in which both students and the instructor decide how, what, and when learning occurs.”</p> <p class='text-paragraph'>On the other hand, teacher-centered teaching style is considered as “a style of instruction that is formal, controlled, and autocratic in which the instructor directs how, what, and when students learn” (Al-Zu’be Ahmad, 2013). The purpose of this essay is to compare and contrast the teacher-centered and pupil-centered approaches to teaching by emphasizing the similarities and differences.</p> <p class='text-paragraph'>The first similarity between teacher-centered and pupil-centered methods of teaching is their purpose: both aim to make learners’ comprehension easier. Both use the same materials, and both include question-and-answer opportunities, with the teacher as an information resource.</p> <p class='text-paragraph'>The second similarity is that both methods use the same material. In teacher-centered approaches, when a teacher transmits knowledge, both teacher and student use the same book. The communication between pupils and teacher is necessary in preparing the material. Using different material would complicate the teaching learning process.</p> <p class='text-paragraph'>The third similarity is the presence of question and answer. In teacher-centered approaches, after the teacher transmits knowledge, students may ask questions, which the teacher answers. In student-centered approaches, pupils may ask each other questions, with the teacher providing correction when needed. The teacher still plays an important role as an instructor and information resource in both approaches.</p> <p class='text-paragraph'>Differences include: student work (individual vs group/pair), participation (passive vs active), classroom environment (quiet vs busy), assessment (post-teaching exams vs integrated projects), and teacher responsibilities (extensive vs facilitative). Teacher-centered approaches are more traditional, focusing on the teacher as instructor, sometimes called direct instruction or lecture-based. Student-centered approaches, sometimes called discovery learning, place stronger emphasis on the learner’s role. Teacher-centered assessments monitor pupil learning via exams, while student-centered assessments diagnose and promote learning via portfolios, performances, and projects.</p> <p class='text-paragraph'>In conclusion, teaching is not strictly teacher-centered or learner-centered. Learner-centered teachers still need to lecture. The bond between teaching approaches is inseparable, and blending methods serves the students’ and teachers’ best interests, ensuring active participation and optimal learning outcomes.</p> </div> </div>"
          }






        ]
      },
      {
        "id": "sp-ph-3",
        "title": "Sp & Ph",
        "moduleTitle": "Speaking and Phonetics",
        "aboutModule":"",
        "coefTag": 2,
        "lessons": []
      },
      {
        "id": "ptes-3",
        "title": "PTES",
        "moduleTitle": "Pedagogical Trends and Educational Systems (PTES)",
        "aboutModule":"This module explores the foundations of Western education, tracing the shift from the abstract, conversational methods of Socrates and the Sophists to the structured, institutional systems of Plato’s Academy and Aristotle’s Lyceum. You will analyze how the Greek transition from 'rhetoric as persuasion' to 'logic as truth' shaped the modern concept of the university and the professionalization of teaching.",
        "coefTag": 1,
        "lessons": [
          { 
            "title": "From the Greek Era to the Middle Ages",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>From the Greek Era to the Middle Ages</h1> <div class='article-section'> <h2 class='content-h2'>1.1 Introduction</h2> <p class='text-paragraph'>The Greeks are considered as the <span class='text-highlight'>founding fathers of the occidental civilization</span>. A number of important inventions are attributed to them which are now part of the human patrimony. We can namely mention geometry, theoretical mathematics, logic, grammar, rhetoric, philosophy, physics, biology, scientific astronomy (based on mathematics), the theatre and the Olympic Games.</p> <p class='text-paragraph'>They have also invented a model of education that takes form mainly in the teaching of philosophy and in the philosophical schools of the antiquity. In fact, philosophers invented the first schools in Athens where small groups of learners studied. These schools were designed not for children, but rather for adolescents and adults. Philosophers are thus the ancestors of university teachers.</p> <p class='text-paragraph'>Somehow, they invented the first universities, the first public places entirely designed for study and the search for Truth. They are rightly considered as the founding fathers of the occidental educational history. Their objective was not to teach a particular type of human being as was the case in the other civilizations of that time, but rather to form the <span class='text-highlight'>complete human being</span>, both spiritually and mentally. They aimed at developing in him the critical sense, reason and emotion, the capacity to think and to have superior feelings.</p> <p class='text-paragraph'>In what follows, we shall examine some conceptions suggested by thinkers—essentially philosophers—of the antiquity concerning education, training, culture and other dimensions related to the field of education. We shall consider the conceptions put forward by the sophists, Socrates and Plato. These are philosophical, theoretical and abstract conceptions which are not directly applied to pedagogy as we conceive of it in our modern schools. These conceptions are rather related to the philosophical foundations of education in general.</p> <h3 class='content-h3-decorated'>The Problem of Plurality</h3> <p class='text-paragraph'>In education, the Greeks knew the problem of the plurality of education which was the result of their political system (democracy and the role of thinking and rational discussion) as well as the discovery of other cultures. There were simultaneously two types of education in Greece:</p> <div class='data-table-wrapper'> <table class='data-table'> <thead> <tr> <th>Traditional Education</th> <th>New Education</th> </tr> </thead> <tbody> <tr> <td>Military and Aristocratic</td> <td>Philosophical and Mystic</td> </tr> <tr> <td>Took place within the family</td> <td>Sophisticated and organized</td> </tr> <tr> <td>Inspired by poetry models of virtue</td> <td>Based on science and democracy</td> </tr> </tbody> </table> </div> <p class='text-paragraph'>In the 5th Century B.C. traditional education was seriously questioned. Due to the culture crisis, the appearance of writing, the development of sciences and philosophy and democracy, the old traditional education did not work anymore. This situation of conflict led the Greeks to search for new forms of education. In fact, they turned towards 'new philosophers' (religious people, wise men, sophists) to provide them with new education for adolescents (only boys).</p> <div class='callout-box'> <span class='callout-quote'>'There are many forms of education, which is the best? Which one to choose?'</span> <small class='callout-attribution'>— The Greek Educational Dilemma</small> </div> <p class='text-paragraph'>This problem is not related to how to educate but to <span class='text-highlight'>why to educate</span>, i.e., to the objectives. The Greeks had to think of the objectives of education. This problem implied an important political dimension because education does not only aim at training individuals, but also responsible citizens inside the community. This critical situation can be illustrated by the Sophists and Socrates.</p> </div> </div>"
          },
          { 
            "title": "The Sophists",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>The Sophists: Masters of Discourse</h1> <div class='article-section'> <h2 class='content-h2'>2. The Sophists</h2> <p class='text-paragraph'>A sophist is somebody who knows or a wise man, or as we would say nowadays a cultivated man. Sophists are men of high culture and knowledge, distinguished by their power of spirit and words. They were mostly foreigners or travelers who moved from one town to another to sell their talent. They can be defined as the <span class='text-highlight'>masters of discourse</span>, masters of 'know how to speak' in public, of 'know how to convince'.</p> <div class='media-container'> <img src='https://res.cloudinary.com/dzkeko6xw/image/upload/w_300,f_auto,q_auto/v1771011630/sophists_y1ynch.jpg' alt='Sophists teaching' class='media-img'> <span class='media-caption'>Illustration of Sophists engaging students, highlighting their focus on rhetoric and persuasive speech.</span> </div> <p class='text-paragraph'>They suggested to their pupils to learn to express themselves so as to be able to talk in all circumstances. They considered language not as a means of knowledge but as a means of control and action towards the others, or a tool of persuasion. The sophists are the inventors of rhetoric and eloquence that played a major role afterwards since the art of speaking well remained till the 20th Century a sign of a good education and high culture.</p> <h3 class='content-h3-decorated'>The Literary Culture</h3> <p class='text-paragraph'>They are the creators of what is called 'literary culture' or the 'great culture' based on the idea that knowledge is not only a content of truth, but also a <span class='text-highlight'>form of beauty</span>. So, it is not sufficient to tell the Truth, but it has to be nicely said. Their vision of education is deeply determined by politics, or democracy, which requires a general competence on the part of all citizens: being able to express themselves in public in a coherent way so as to convince the others of the value of their opinion.</p> <h3 class='content-h3-decorated'>Professionalization of Teaching</h3> <p class='text-paragraph'>The sophists are considered as the first teachers. With them, education was no more a family enterprise managed by the daily social milieu. The sophistic education was:</p> <ul class='list-standard'> <li class='list-item'><strong>Organized:</strong> It consciously wanted to achieve a goal.</li> <li class='list-item'><strong>Individual:</strong> It was not collective, but focused on the pupil.</li> <li class='list-item'><strong>Professional:</strong> The teacher offered services for pay; pupils had to leave their homes to study.</li> <li class='list-item'><strong>Theoretical:</strong> They valued general culture and abstract notions over specialized craftsmanship.</li> </ul> <p class='text-paragraph'>The sophists did no teach a specialized knowledge, but a general culture, i.e., how to think, how to live and how to speak. They were not craftsmen or specialized technicians but exclusively teachers.</p> </div> </div>"
          },
          {
            "title": "Socrates",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>Socrates: The Father of Western Philosophy</h1> <div class='article-section'> <h2 class='content-h2'>3. Who is Socrates?</h2> <p class='text-paragraph'>Socrates (c. 469 BC – 399 BC) was a renowned Greek teacher who preferred conversational teaching and left no written records. Our knowledge of his teachings comes primarily from his students, such as Plato. Socrates believed that <span class='text-highlight'>wisdom begins in admitting your own ignorance</span> and that self-knowledge is the ultimate virtue.</p> <div class='media-container'> <img src='https://res.cloudinary.com/dzkeko6xw/image/upload/w_300,f_auto,q_auto/v1771010805/socrates_pn6tpz.webp' alt='Statue of Socrates' class='media-img'> <span class='media-caption'>Statue of Socrates, representing his lifelong pursuit of truth and dialogue.</span> </div> <div class='callout-box'> <p class='text-paragraph'>Socrates repeatedly disavowed his own knowledge. This was not a lack of intelligence, but a technique for engaging others and empowering them to engage in open dialogue. He believed people could arrive at the truth through persistent questioning.</p> </div> <h3 class='content-h3-decorated'>The Socratic Method</h3> <p class='text-paragraph'>Socrates is regarded as one of the greatest teachers of all time. His method involves a teacher asking leading questions to guide students toward discovery. He devoted himself to free-wheeling discussions with young citizens, questioning their confidence in popular opinions without always offering a clear alternative teaching.</p> <h2 class='content-h2'>3.1 Gorgias by Plato</h2> <p class='text-paragraph'>In Plato's writings, Socrates declared that his aim in life was to learn rather than to transmit knowledge. While some contemporaries viewed him as a sophist, he differed from them in several key ways:</p> <ul class='list-standard'> <li class='list-item'><strong>No Lessons:</strong> He did not have pupils in the traditional sense because he claimed to know nothing and thus transmitted nothing.</li> <li class='list-item'><strong>No Salary:</strong> He never asked for payment when talking to young people.</li> <li class='list-item'><strong>Adversarial Relationship:</strong> He constantly criticized the sophists during direct dialogue exchanges.</li> <li class='list-item'><strong>Role Inversion:</strong> He wanted to learn more than to teach, often becoming the 'pupil of his pupils.'</li> </ul> <h2 class='content-h2'>3.2 Analysis: Maieutics and the Search for Truth</h2> <p class='text-paragraph'>Socrates was a man of dialogue who talked to everyone—nobles, soldiers, and ordinary citizens. His method, <span class='text-highlight'>maieutics</span>, is the art of dialogue. It consists of letting others express their ideas and then asking questions about the definitions of the notions they use.</p> <p class='text-paragraph'>Socrates was the first to understand the necessity of <span class='text-highlight'>defining words</span> to arrive at an agreement; he is the inventor of definition. He led people to think for themselves rather than repeating traditional beliefs or prejudices. The aim was to use the mind to discover Truth rather than simply accumulating knowledge.</p><h3 class='content-h3-decorated'>Contribution to Education</h3> <p class='text-paragraph'>Socrates fostered the idea that education is not about transmitting content, but a process where the learner assumes their own thoughts and convictions. Discussion, to Socrates, was not just a tool; it was the means by which education is produced and the objective itself, leading to 'discursive competence'—the ability to understand and express oneself through logical arguments.</p> <h2 class='content-h2'>3.3 Difference between the Sophists and Socrates</h2> <div class='data-table-wrapper'> <table class='data-table'> <thead> <tr> <th>Feature</th> <th>The Sophists</th> <th>Socrates</th> </tr> </thead> <tbody> <tr> <td><strong>Goal</strong></td> <td>Knowing how to speak and argue.</td> <td>Developing logical arguments to convince via truth.</td> </tr> <tr> <td><strong>Payment</strong></td> <td>Charged money for services.</td> <td>Taught for free.</td> </tr> <tr> <td><strong>Method</strong></td> <td>Imposed points of view (what to think).</td> <td>Guided the discovery of truth (how to think).</td> </tr> <tr> <td><strong>Philosophy</strong></td> <td>Persuasion over knowledge.</td> <td>Knowledge = Virtue = Happiness.</td> </tr> <tr> <td><strong>Role</strong></td> <td>Hired by the wealthy to win arguments.</td> <td>Sought understanding as the key to happiness.</td> </tr> </tbody> </table> </div> <div class='callout-box'> <span class='callout-quote'>'The Greek philosophers did not develop a child pedagogy, as real education started only when a person was mature enough to talk and think autonomously.'</span> </div> <p class='text-paragraph'>While Sophists used well-formed words to persuade people regardless of the material's truth, Socrates refused to argue points he did not believe in. For him, knowledge and understanding were the only paths to true virtue.</p> </div> </div>"
          },
          { 
            "title": "Gorgias",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>Gorgias: The Socratic Dialogue in Action</h1> <div class='article-section'> <h2 class='content-h2'>3.5 Gorgias (The Extract) by Plato</h2> <div class='callout-box'> <p class='text-paragraph'><strong>Socrates:</strong> Very good then; as you profess to be a rhetorician, and a maker of rhetoricians, let me ask you, with what is rhetoric concerned: I might ask with what is weaving concerned, and you would reply (would you not?), with the making of garments?<br/><strong>Gorgias:</strong> Yes.<br/><strong>Socrates:</strong> And music is concerned with the composition of melodies?<br/><strong>Gorgias:</strong> It is.<br/><strong>Socrates:</strong> By Here, Gorgias, I admire the surpassing brevity of your answers... answer me in like manner about rhetoric: with what is rhetoric concerned?<br/><strong>Gorgias:</strong> With discourse.</p> </div> <p class='text-paragraph'>Socrates continues to question Gorgias, challenging the scope of rhetoric. He asks if rhetoric teaches the sick how to get well, to which Gorgias replies no. Socrates then points out that in the assembly, when electing a physician, shipwright, or general, the experts in those crafts—not the rhetorician—are consulted. He poses the ultimate question: 'What is the use of coming to you, Gorgias? About what will you teach us to advise the state?--about the just and unjust only, or about those other things also which Socrates has just mentioned?' How will you answer them?</p> <h2 class='content-h2'>3.5 Analysis of the Extract</h2> <p class='text-paragraph'>Socrates was a man of dialogue. He liked to talk to young people particularly, but also to great sophist teachers, nobles, soldiers, ordinary citizens; in short, to everyone. He was interested in what people thought they knew, in their certainties, beliefs, ideas, knowledge. His method was called <span class='text-highlight'>maieutics</span>, which is an art of dialogue. It consisted of discussing with others, letting them express their own ideas and asking them questions about the meaning and definition of the notions they use.</p> <p class='text-paragraph'>Socrates was the first to understanding the necessity of defining the words people used in order to arrive at an agreement. He is the inventor of definition. Thus he obliged people to think by themselves, rather than to repeat ready-made ideas, prejudices and traditional beliefs. The aim of maieutics is therefore to lead people to use their minds and to discover Truth by themselves. Socrates emphasized the search for Truth rather than the accumulation of knowledge.</p> <p class='text-paragraph'>The contribution of Socrates to the history of education consists of fostering the idea that education is not a process of transmitting or imposing a content or a norm. It is rather a process of training within which the learner is required to assume his own thoughts, his convictions and life orientations by using his mind. According to Socratic philosophy, education is related to the idea of discussions without violence during which the participants expose their respective points of view by using arguments that are susceptible of persuading the participants. For Socrates, discussion is not only a means of education. It is at the same time the means by which education is produced and the objective of training, which is equivalent to the acquisition of a 'discursive competence'.</p> <div class='data-table-wrapper'> <table class='data-table'> <thead> <tr> <th>Educated Person</th> <th>Core Philosophy</th> </tr> </thead> <tbody> <tr> <td><strong>For the sophists</strong></td> <td>To know how to speak, how to argue.</td> </tr> <tr> <td><strong>For Socrates</strong></td> <td>To know how to develop logical argumentations to convince others' of one's point of view.</td> </tr> </tbody> </table> </div> <p class='text-paragraph'>Therefore, the Greek philosophers did not really develop a child pedagogy, since for them real education started only when a person is mature enough to talk and to think autonomously.</p> </div> </div>"
          },
          {
            "title": "Plato",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>Plato: The Utopian Vision and the First Academy</h1> <div class='article-section'> <h2 class='content-h2'>4. Plato</h2> <p class='text-paragraph'>He was Socrates' disciple. Socrates was condemned to suicide for political reasons, an event that represented for Plato the failure of Socratic method and education. Plato believed it was necessary to go beyond discussion and propose a more powerful education capable of deeply transforming men, rather than just their discourse.</p> <div class='media-container'> <img src='https://res.cloudinary.com/dzkeko6xw/image/upload/v1771012055/plato_o9itkk.jpg' alt='Statue of Plato' class='media-img'> <span class='media-caption'>Statue of Plato.</span> </div> <p class='text-paragraph'>For Plato, true education is a substitute for policy. In a political situation dominated by violence, he considered education a means to re-make human society. As an <span class='text-highlight'>utopist</span>, his aim was to completely re-make man by shaping him from childhood. He proposed a pedagogy based on a long learning process through different degrees of knowledge, stretching from adolescence to adulthood.</p> <h3 class='content-h3-decorated'>Meritocracy and Social Structure</h3> <p class='text-paragraph'>His education followed a meritocratic ideology where all adolescents—rich or poor, boys or girls—underwent the same training. Gradually, children would be distinguished by their natural merits into three social components:</p> <ul class='list-standard'> <li class='list-item'><strong>Workers and Peasants:</strong> Those who provide the material needs of society.</li> <li class='list-item'><strong>Guards (Soldiers):</strong> Those who protect the community.</li> <li class='list-item'><strong>Philosophers:</strong> The minority who lead based on their grasp of truth.</li> </ul> <h2 class='content-h2'>4.1 Plato's Academy</h2> <p class='text-paragraph'>In 387 B.C., Plato founded the Academy in a garden near Athens. While it began as a simple gathering place for students, it eventually grew into the first 'think tank' or university. A nobleman named Dionysius II reportedly provided the equivalent of half a million dollars to support the construction of its buildings.</p> <div class='data-table-wrapper'> <table class='data-table'> <thead> <tr> <th>Feature</th> <th>Plato's Academy</th> </tr> </thead> <tbody> <tr> <td><strong>Admission</strong></td> <td>No admission or tuition fees; supported by donations.</td> </tr> <tr> <td><strong>Lifestyle</strong></td> <td>Students lived ascetically and practiced celibacy.</td> </tr> <tr> <td><strong>Curriculum</strong></td> <td>Focused on mathematics, philosophy, law, and music.</td> </tr> <tr> <td><strong>Duration</strong></td> <td>Typical stay was four years (Aristotle stayed for 20).</td> </tr> </tbody> </table> </div> <p class='text-paragraph'>The atmosphere of the Academy was distinct from the marketplace where Socrates taught or the gymnasiums of the Sophists. While rival schools taught rhetoric and persuasion, the Academy focused on the <span class='text-highlight'>pursuit of truth</span> and mathematics. It provided the model for modern universities and scientific academies, counting among its students figures like Demosthenes, Aristotle, Lycurgus, and several women.</p> </div> </div>"
          },
          { 
            "title": "Aristotle",
            "content": "<div class='lesson-container'> <h1 class='content-h1'>Aristotle: The Empirical Transformation of Knowledge</h1> <div class='article-section'> <h2 class='content-h2'>5. Aristotle (384 BC—322 BC)</h2> <div class='media-container'> <img src='https://res.cloudinary.com/dzkeko6xw/image/upload/w_300,f_auto,q_auto/v1771011323/aristotle_obexdy.webp' alt='Aristotle teaching' class='media-img'> <span class='media-caption'>Aristotle, the mind that observed the world to uncover knowledge and reason.</span> </div> <p class='text-paragraph'>Aristotle is a towering figure in ancient Greek philosophy who made important contributions to logic, rhetoric, biology, mathematics, and politics. A student of Plato for twenty years, he became famous for rejecting Plato’s theory of forms, favoring a more <span class='text-highlight'>empirically minded</span> approach based on observation.</p> <p class='text-paragraph'>As the father of Western logic, Aristotle developed the first formal system for reasoning. He discovered that the validity of an argument is determined by its structure rather than its content. This is best seen in the <strong>syllogism</strong>:</p> <div class='callout-box'> <p class='text-paragraph'>1. All men are mortal (Premise)<br/>2. Socrates is a man (Premise)<br/>3. Therefore, Socrates is mortal (Conclusion)</p> </div> <h3 class='content-h3-decorated'>Natural Philosophy and Metaphysics</h3> <p class='text-paragraph'>In his natural philosophy, Aristotle combined logic with observation. In biology, he used the concept of species to make empirical claims. In psychology, he viewed the body as matter and the <span class='text-highlight'>psyche as the form</span> of each living animal. In his ethics, he held that excellence is the only path to <strong>eudaimonia</strong>—a state of happiness that constitutes the best kind of human life.</p> <h2 class='content-h2'>5.1 The Academy Years</h2> <p class='text-paragraph'>Aristotle joined Plato's Academy at age 17 and remained for 20 years. While his early works like <em>Eudemus</em> show a strong Platonic influence, he eventually distanced himself from Plato’s theory of Forms. Plato argued that a suprasensible realm of Forms makes particular things intelligible (e.g., a horse is a horse because it imitates the Form of 'Horse').</p> <p class='text-paragraph'>Aristotle countered this in <em>Metaphysics</em>, arguing that immutable Forms cannot explain how particulars come into existence or change. To him, the theory simply introduced new entities without solving the problems of the physical world.</p> <h2 class='content-h2'>5.2 The Lyceum</h2> <div class='media-container'> <img src='https://res.cloudinary.com/dzkeko6xw/image/upload/w_300,f_auto,q_auto/v1771012330/lyceum_ikqz8x.jpg' alt='The Lyceum' class='media-img'> <span class='media-caption'>The Lyceum, Aristotle’s school, where empirical observation and discussion shaped knowledge.</span> </div> <p class='text-paragraph'>At age 50, Aristotle established his own school, the <span class='text-highlight'>Lyceum</span>. His followers were known as <strong>peripatetics</strong> because they walked (peripatos) during their discussions. Unlike the private Academy, many lectures at the Lyceum were open to the public and free of charge.</p> <div class='data-table-wrapper'> <table class='data-table'> <thead> <tr> <th>Feature</th> <th>Plato's Academy</th> <th>Aristotle's Lyceum</th> </tr> </thead> <tbody> <tr> <td><strong>Approach</strong></td> <td>Dialectical, focus on abstract Forms</td> <td>Systematic, empirical, and observational</td> </tr> <tr> <td><strong>Nature</strong></td> <td>Private club for the aristocracy</td> <td>Public lectures and research center</td> </tr> <tr> <td><strong>Contribution</strong></td> <td>Model for social academies</td> <td>Invention of distinct intellectual disciplines</td> </tr> </tbody> </table> </div> <h2 class='content-h2'>Conclusion</h2> <p class='text-paragraph'>The ideas of the Greek thinkers provided the heart of classical culture. However, the educational thinking of the Sophists and philosophers was never confronted with the concrete problem of educating children in a classroom. They did not have an educational system, a school, or child pedagogy as we know them today.</p> <p class='text-paragraph'>Instead, their thinking was oriented toward the <span class='text-highlight'>foundations of education</span>—designed for already shaped men to be transformed through words, discussion, and persuasion. The focus on school instruction and pedagogy would only come later in history.</p> </div> </div>"
          }

        ]
      },
      {
        "id": "brit-am-lit-3",
        "title": "Brit/Am Lit",
        "moduleTitle": "British / American Literature",
        "aboutModule":"you will study poems and some literary devices + how to write an analysis.<br/>S1 British litterature.<br/>S2 American litterature.",
        "coefTag": 2,
        "lessons": []
      },
      {
        "id": "ict-3",
        "title": "ICT",
        "moduleTitle": "Information and Communication Technology (ICT)",
        "coefTag": 1,
        "lessons": [
        ]
      },
      {
        "id": "rtl-intro-psycho-3",
        "title": "م إ علم النفس",
        "moduleTitle": "مدخل إلى علم النفس",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "linguistics-3",
        "title": "Linguistics",
        "moduleTitle": "Linguistics",
        "coefTag": 1,
        "lessons": []
      }
    ]
  },
  
  "4th": {
    "name": "4th Year PEM PES",
    "modules": [
      {
        "id": "psychopeda-4",
        "title": "Psychopeda.",
        "moduleTitle": "Psychopedagogy",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "legislation-4",
        "title": "Legislation R/M",
        "moduleTitle": "Legislation",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "brit-am-civ-4",
        "title": "Brit/Am Civ.",
        "moduleTitle": "British / American Civilization",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "af-civ-lit-4",
        "title": "Af. Civ/Lit",
        "moduleTitle": "African Civlization & Literature",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "tbesd-4",
        "title": "TBESD",
        "moduleTitle": "TBESD (acro)",
        "coefTag": 2,
        "lessons": []
      },
      {
        "id": "app-ling-4",
        "title": "App. Ling.",
        "moduleTitle": "Applied Linguistics",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "brit-am-lit-4",
        "title": "Brit/Am Li.",
        "moduleTitle": "British / American Literature",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "tefl-4",
        "title": "TEFL",
        "moduleTitle": "Teaching English as a Foreign Language",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "mdd-4",
        "title": "MDD",
        "moduleTitle": "MDD (acro)",
        "coefTag": 2,
        "lessons": []
      }
    ]

    },
    
  "5th": {
        "name": "5th Year PES",
        "modules": [
        {
            "id": "issues-5",
            "title": "Issues in C.",
            "moduleTitle": "Issues in Culture",
            "coefTag": 1,
            "lessons": []
        },
        {
            "id": "legislation-5",
            "title": "Legislation",
            "moduleTitle": "Legislation",
            "coefTag": 1,
            "lessons": []
        },
        {
            "id": "brit-am-lit-5",
            "title": "Brit/Am Lit.",
            "moduleTitle": "British / American Literature",
            "coefTag": 1,
            "lessons": []
        },
        {
            "id": "app-ling-5",
            "title": "App. Ling.",
            "moduleTitle": "Applied Linguistics",
            "coefTag": 1,
            "lessons": []
        },
        {
            "id": "syll-des-5",
            "title": "Syll. Des.",
            "moduleTitle": "Syllabus Design",
            "coefTag": 1,
            "lessons": []
        },
        {
            "id": "brit-am-civ-5",
            "title": "Brit/Am Civ.",
            "moduleTitle": "British / American Civilization",
            "coefTag": 1,
            "lessons": []
        },
        {
            "id": "pedagogy-5",
            "title": "Pedagogy",
            "moduleTitle": "Pedagogical Trends",
            "coefTag": 1,
            "lessons": []
        },
        {
            "id": "af-civ-lit-5",
            "title": "Af. Civ/Lit",
            "moduleTitle": "African Civilization & Literature",
            "coefTag": 1,
            "lessons": []
        }
        ]
    }
}
