{
  "1st": {
    "name": "1st Year PEM PES",
    "modules": [
      {
        "id": "writing-1",
        "title": "Writing",
        "moduleTitle": "Writing",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "ict-1",
        "title": "ICT",
        "moduleTitle": "Information and Communication Technology (ICT)",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "ph-phono-1",
        "title": "Ph & Phono",
        "moduleTitle": "Phonetics and Phonology",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "linguistics-1",
        "title": "Linguistics",
        "moduleTitle": "Linguistics",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "grammar-1",
        "title": "Grammar",
        "moduleTitle": "Grammar",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "reading-1",
        "title": "Reading",
        "moduleTitle": "Reading",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "culture-1",
        "title": "Culture Studies",
        "moduleTitle": "Culture Studies",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "arabic-1",
        "title": "لغة عربية",
        "moduleTitle": "لغة عربية",
        "coefTag": 0,
        "lessons": [

          { 
            "title": "الجانب المظلم من أبولو 11",
            "content": "<h2>الجانب المظلم من أبولو 11: خطاب الكارثة الذي لم يُلقَ</h2><div class='preamble-quote' style='text-align:center; font-weight:normal; line-height:1.8;'><div style='direction:rtl; font-size:1.5rem; margin-bottom:10px;'>لقد قضى القدر بأن الرجال الذين ذهبوا إلى القمر لاستكشافه بسلام، سيبقون على القمر ليرقدوا بسلام.</div><div style='font-size:1.1rem; color:#bbb;'>(كلمات من خطاب الرئيس نيكسون السري في حال فشل العودة)</div></div><div class='article-section'><h3>مهمة انتحارية محتملة</h3><p>خلف المشاهد البطولية التي رآها العالم على شاشات التلفزيون، كان هناك احتمال مرعب يطارد وكالة ناسا: ماذا لو تعطل محرك الصعود؟ ماذا لو حوصر نيل أمسترونج وبز ألدرين على سطح القمر دون وسيلة للعودة؟ كان الجميع يعلم أن احتمالات الفشل التقني مرتفعة، وأن الفضاء لا يغفر الأخطاء.</p><h3>خطاب 'في حالة كارثة القمر'</h3><p>كان الخطر حقيقياً لدرجة أن كاتب خطابات الرئيس ريتشارد نيكسون، ويليام سافاير، أعد خطاباً سرياً ليقرأه الرئيس للأمة في حال تقطعت السبل بالرواد. لم يكن الخطاب يتحدث عن انفجار أو حادث مفاجئ، بل عن سيناريو أكثر رعباً: رواد فضاء أحياء، وبكامل قواهم، لكنهم عالقون للأبد في انتظار نفاد الأكسجين.</p><h4>البروتوكول القاسي</h4><p>وفقاً للخطة، كان على الرئيس نيكسون الاتصال بزوجات الرواد (الأرامل المستقبليات) أولاً، ثم إلقاء الخطاب الذي ينعي فيه 'أبطالنا' بينما لا يزالون على قيد الحياة على بعد 384,000 كيلومتر، ثم تقوم ناسا بقطع الاتصال اللاسلكي معهم لتتركهم يواجهون مصيرهم في صمت كوني.</p><h3>المحرك الذي كان يجب أن يعمل</h3><p>الجزء الأكثر رعباً في المركبة القمرية 'إيجل' كان محرك الصعود. كان هذا المحرك هو السبيل الوحيد للعودة، ولم تكن هناك أي خطة بديلة (Backup) في حال فشله. لم يتمكن المهندسون من اختبار المحرك في بيئة القمر قبل المهمة، وكان عليهم فقط أن يأملوا أن يشتعل عند الضغط على الزر. لو فشل، لم تكن هناك أي فرصة لإنقاذهم.</p><h4>مفتاح التشغيل المكسور</h4><p>في لحظة درامية كادت أن تنهي كل شيء، اكتشف بز ألدرين أن مفتاح التشغيل الكهربائي للمحرك قد انكسر داخل المركبة الضيقة. لعدة ساعات، ساد القلق؛ هل سيقضون بقية حياتهم القصيرة هناك بسبب قطعة بلاستيكية مكسورة؟ في النهاية، استخدم ألدرين قلم 'فلوماستر' لضغط المفتاح المكسور، مما مكنهم من الإقلاع في اللحظة الأخيرة.</p><h3>العزلة التامة لمايكل كولينز</h3><p>بينما كان العالم يتابع أمسترونج وألدرين، كان مايكل كولينز يدور وحيداً في مركبة القيادة 'كولومبيا'. في كل مرة كان يمر فيها خلف الجانب المظلم للقمر، كان ينقطع عنه كل اتصال بالأرض. وصف كولينز لاحقاً شعوره بالوحدة القاتلة، وخوفه من أن يضطر للعودة إلى الأرض وحيداً، ليكون 'الرجل الذي نجا' بينما ترك زملاءه ليموتوا هناك.</p><h3>الحجر الصحي والخوف من 'طاعون الفضاء'</h3><p>حتى بعد عودتهم بسلام وسقوط الكبسولة في المحيط، لم تنتهِ المخاوف. كانت ناسا تخشى أن يكون الرواد قد جلبوا معهم جراثيم أو كائنات مجهرية قاتلة من القمر لا يملك البشر مناعة ضدها. أُجبر الرواد على قضاء 21 يوماً في حجر صحي صارم داخل مقطورة مغلقة، حيث استقبلهم الرئيس نيكسون من خلف زجاج سميك، خوفاً من عدوى فضائية قد تفتك بسكان الأرض.</p></div><h3>حقائق مخفية عن الخطر</h3><table><tr><th>الخطر</th><th>الواقع المرير</th><th>النتيجة المحتملة</th></tr><tr><td>فشل محرك الصعود</td><td>محرك وحيد بلا نظام احتياطي</td><td>بقاء الرواد عالقين حتى نفاد الأكسجين</td></tr><tr><td>مفتاح التشغيل</td><td>انكسر بسبب بدلات الفضاء الضيقة</td><td>تم إصلاحه باستخدام قلم يدوي</td></tr><tr><td>العودة المنفردة</td><td>خوف مايكل كولينز الدائم</td><td>العودة كأرمل لزملائه في المهمة</td></tr><tr><td>التلوث الحيوي</td><td>كائنات قمرية مجهرية</td><td>إبادة محتملة للحياة على الأرض</td></tr></table>"
           },
          {
            "title": "السجل الذهبي",
            "content": "<h2>دليل: كيفية فك تشفير السجل الذهبي</h2><div class='preamble-quote' style='text-align:center; font-weight:normal; line-height:1.8;'><div style='direction:rtl; font-size:1.5rem; margin-bottom:10px;'>تحياتنا للأصدقاء بين النجوم، يا ليت يجمعنا الزمان</div></div><div class='article-section'><h3>سفير النجوم</h3><p>في الفراغ الصامت واللانهاية للفضاء البينجمي، يطفو قرص ذهبي يحمل نبض كوكبنا. السجل الذهبي لفوياجر، الذي أُطلق في عام 1977، هو أكثر من مجرد قطعة تقنية؛ إنه الإرث الأسمى للبشرية. يمثل يداً ممدودة بالأمل عبر الكون، صُممت لتصمد لمليارات السنين - لفترة طويلة بعد أن تتحول المدن التي بنته إلى غبار. إنه قول جنسنا البشري للكون: 'لقد كنا هنا، وهذا ما أحببناه'.</p><h3>الخطوة 1: العثور على 'ساعة الهيدروجين'</h3><p>تخيل أنك كائن فضائي. لا تعرف ما هي 'الثانية' أو 'الدقيقة'. لمساعدتك، رسمت ناسا دائرتين في أسفل الغلاف. هذه ذرة هيدروجين. عندما تتغير حالة ذرة الهيدروجين، فإنها تبعث نبضة ضئيلة من الطاقة. هذه النبضة هي 'التكة العالمية'. كل رسم آخر على الغلاف يستخدم هذه 'التكة' ليخبرك بمدى السرعة التي يجب أن تشغل بها السجل.</p><h4>مفتاح الزمن</h4><p>على الغلاف، سترى رموزاً ثنائية (شرطات ونقاط). هذه ليست أرقاماً مثل 1 أو 2 أو 3. إنها تمثل مضاعفات نبضة الهيدروجين تلك. هذا يخبر الكائن الفضائي: 'قم بتدوير القرص بهذه السرعة المحددة، وإلا ستبدو الموسيقى مثل أصوات زقزقة عالية الحدة!'</p><h3>الخطوة 2: بناء مشغل الأسطوانات</h3><p>السجل لم يأتِ مع جهاز دوار، لكنه جاء مع إبرة. الرسوم في أعلى اليسار تظهر القرص والإبرة في الموضع الصحيح. إذا اتبع الكائن الفضائي الحسابات التي قدمتها ساعة الهيدروجين، فسيعرف بالضبط عدد المرات التي يجب أن يدور فيها السجل في الدقيقة (حوالي 16 وثلثي دورة في الدقيقة).</p><h4>المنظور الجانبي</h4><p>هناك رسم للسجل من الجانب. هذا يوضح للكائن الفضائي مدى عمق الإبرة في الأخاديد. إنه 'دليل تعليمي' حرفي لبناء مشغل أسطوانات من الصفر باستخدام تقنية فضائية.</p><h3>الخطوة 3: تحويل الصوت إلى صور</h3><p>هذا هو الجزء الأكثر 'سحراً'. يظهر أعلى يمين الغلاف سلسلة من الخطوط المتداخلة. هذا يوضح أن 'الأصوات' الموجودة في النصف الثاني من السجل هي في الواقع صور. تتكون كل صورة من 512 خطاً عمودياً، تماماً مثل طريقة عمل التلفزيون التناظري القديم.</p><h4>إشارة 'المسح'</h4><p>أدرجت ناسا صوت 'تحفيز' محدد قبل كل صورة. إذا قام الكائن الفضائي بتوصيل الإبرة بشاشة بدلاً من مكبر صوت، فإن تلك الأصوات سترسم خطوطاً من الضوء. خطاً تلو الآخر، ستظهر صورة لجبل، أو زهرة، أو إنسان على شاشته الفضائية.</p><h3>الخطوة 4: العثور على الأصل (خريطة النجوم النابضة)</h3><p>نمط 'انفجار النجوم' الكبير على اليسار هو الخريطة المؤدية إلى الأرض. تستخدم 14 نجماً نابضاً - وهي نجوم ميتة تومض بتوقيت مثالي، مثل المنارات الكونية. يوضح كل خط الاتجاه والمسافة من شمسنا إلى ذلك النجم النابض.</p><h4>العنوان العالمي</h4><p>بما أن النجوم النابضة تتباطأ بمعدل يمكن التنبؤ به عبر ملايين السنين، يمكن للكائن الفضائي أن ينظر إلى معدلات النبض في السجل، ويقارنها بالنجوم التي يراها في السماء، ويحسب بالضبط متى تم إطلاق السجل ومن أين جاء.</p><h3>الخطوة 5: المحتوى (ماذا يوجد بالداخل؟)</h3><p>بمجرد فك التشفير، ينقسم المحتوى إلى أربعة 'مجلدات' رئيسية من التاريخ البشري. إنها كبسولة زمنية تهدف إلى تمثيل أفضل ما لدينا، أُرسلت إلى ظلام الفضاء البارد.</p><h4>معرض الحياة</h4><p>هناك 116 صورة. تبدأ بحساب بسيط (1+1=2) للتأكد من أن الكائن الفضائي يفهم منطقنا. ثم تأتي صور للحمض النووي، وتشريح الإنسان، وكيف نأكل. هناك صور لسور الصين العظيم، وتاج محل، وسوبر ماركت بسيط.</p><h4>سيمفونية الأرض</h4><p>تغطي الموسيقى العالم بأكمله. وهي تشمل 'جوني بي جود' لتشاك بيري (روك آند رول)، و'ميلانكولي بلوز' للويس أرمسترونج (جاز)، وروائع كلاسيكية. أرادت ناسا أن تظهر أن البشر نوع يعبر عن مشاعره العميقة من خلال الإيقاع واللحن.</p><h4>التحيات</h4><p>أخيراً، يحمل السجل أصواتاً. يحتوي على رسالة من الأمين العام للأمم المتحدة ورسالة من الرئيس جيمي كارتر، الذي كتب: 'هذه هدية من عالم صغير وبعيد... نحن نحاول النجاة في عصرنا حتى نتمكن من العيش في عصركم'.</p><h3>لماذا هذا مهم؟</h3><p>ستنفد طاقة مسابير فوياجر في النهاية وتصمت. سوف تنجرف إلى الأبد. السجل الذهبي هو وسيلة للبشرية لتصبح خالدة. حتى لو دمرت الشمس الأرض في غضون خمسة مليارات سنة، فإن هذا السجل سيظل موجوداً هناك، يروي قصة كوكب أزرق أحب وضحك وصنع الموسيقى يوماً ما.</p></div><h3>جدول ملخص سريع</h3><table><tr><th>الرمز على الغلاف</th><th>ماذا يعني</th><th>الترجمة البسيطة</th></tr><tr><td>دوائر مع نقاط</td><td>ذرة الهيدروجين</td><td>'الثانية' العالمية</td></tr><tr><td>خطوط انفجار النجوم</td><td>خريطة النجوم النابضة</td><td>الخريطة المؤدية لشمسنا</td></tr><tr><td>مستطيلات عمودية</td><td>شكل موجة الصورة</td><td>كيفية رسم الصور</td></tr><tr><td>علامات '1' الثنائية</td><td>وحدات زمنية</td><td>سرعة تشغيل السجل</td></tr></table>"
          }

        ]
      }
    ]
  },

  "2nd": {
    "name": "2nd Year PEM PES",
    "modules": [
      {
        "id": "west-civ-lit-2",
        "title": "West. Civ/Lit",
        "moduleTitle": "Western Civilization & Literature",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "grammar-2",
        "title": "Grammar",
        "moduleTitle": "Grammar",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "ict-2",
        "title": "ICT",
        "moduleTitle": "Information and Communicatoin Technology",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "ed-psych-2",
        "title": "علم ن التربوي",
        "moduleTitle": "علم النفس التربوي",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "linguistics-2",
        "title": "Linguistics",
        "moduleTitle": "Linguistics",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "reading-2",
        "title": "Reading",
        "moduleTitle": "Reading",
        "coefTag": 0,
        "lessons": []
      },
      {
        "id": "phonetics-2",
        "title": "Phonetics",
        "moduleTitle": "Phonetics",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "writing-2",
        "title": "Writing",
        "moduleTitle": "Writing",
        "coefTag": 0,
        "lessons": []
      }
    ]
  },

  "3rd": {
    "name": "3rd Year PEM PES",
    "modules": [
      {
        "id": "brit-am-civ-3",
        "title": "Brit/Am Civ.",
        "moduleTitle": "British / American Literature",
        "coefTag": 5,
        "lessons": [
          {
            "title": "Famous American Assassinations",
            "content": "<h2>Famous American Assassinations</h2><div class='preamble-quote'>An assassination is the killing of an important public figure. In the United States, some assassinations shocked the nation and changed history forever.</div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>Abraham Lincoln (1865)</h3><h4>Who was he?</h4><p>Abraham Lincoln was the 16th president of the United States. He led the country during the Civil War (a war between the North and the South).</p><h4>Why was he important?</h4><p>Lincoln believed the country should stay united. He also worked to end slavery (slavery = owning people and forcing them to work).</p><h4>What happened after?</h4><p>His death created political chaos (chaos = confusion and loss of control). The country struggled to heal.</div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>John F. Kennedy (1963)</h3><h4>The time he lived in</h4><p>Kennedy lived during the Cold War (Cold War = tension between powerful countries without direct fighting).</p><h4>Why people admired him</h4><p>He was young, confident, and optimistic (optimistic = believing the future will be better).</p><h4>Impact</h4><p>After his assassination, many Americans lost trust in the government. Trust never fully returned.</div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>Malcolm X (1965)</h3><h4>His role</h4><p>Malcolm X was a strong and direct speaker. He talked about racism (racism = unfair treatment based on skin color).</p><h4>His ideas</h4><p>He believed Black Americans should protect themselves. His ideas were radical (radical = very strong and different from the norm).</p><h4>Impact</h4><p>His assassination removed an important voice, but his ideas continued to influence future movements.</div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>Martin Luther King Jr. (1968)</h3><h4>Who he was</h4><p>Martin Luther King Jr. was a civil rights leader (civil rights = equal rights for all citizens).</p><h4>His method</h4><p>He believed in non-violence (non-violence = no physical harm). He used speeches and peaceful protests.</p><h4>Impact</h4><p>His death caused nationwide grief (grief = deep sadness), but also led to stronger civil rights laws.</div><h3>Quick Summary</h3><table><tr><th>Person</th><th>Year</th><th>Main Idea</th><th>Result</th></tr><tr><td>Abraham Lincoln</td><td>1865</td><td>Unity & ending slavery</td><td>Nation stayed divided</td></tr><tr><td>John F. Kennedy</td><td>1963</td><td>Hope & progress</td><td>Loss of trust</td></tr><tr><td>Malcolm X</td><td>1965</td><td>Self-defense & pride</td><td>Stronger identity movements</td></tr><tr><td>Martin Luther King Jr.</td><td>1968</td><td>Peaceful equality</td><td>Civil rights laws</td></tr></table>"
          },
          {
            "title": "The Space Race: A Journey to the Moon",
            "content": "<h2>The Space Race: A Journey to the Moon</h2><div class='preamble-quote'>The Space Race was a 20th-century competition between the United States and the Soviet Union to see who could achieve the greatest milestones in outer space exploration.</div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>The Beginning: Sputnik and Fear (1957)</h3><h4>The Surprise Launch</h4><p>In 1957, the Soviet Union launched Sputnik 1, the first man-made satellite. This shocked the U.S. because it proved the Soviets had rockets powerful enough to reach space—and potentially carry nuclear weapons.</p><h4>National Defense Education</h4><p>The U.S. responded by passing laws to pour money into science and math education. They didn't just want to win a race; they wanted to ensure American technology remained the most advanced in the world.</p><h4>The Creation of NASA</h4><p>In 1958, President Eisenhower created NASA. This moved space exploration from a military project to a civilian one, focusing on peaceful exploration (though the competition remained intense).</p></div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>Project Mercury: The First Heroes (1958–1963)</h3><h4>The Goal</h4><p>The mission was simple: put a human in orbit and bring them back safely. Engineers had to figure out how to keep a human alive in the vacuum of space and during the heat of reentry.</p><h4>First Successes</h4><p>Alan Shepard became the first American in space in 1961 (just weeks after the Soviet Yuri Gagarin). In 1962, John Glenn became the first American to orbit the Earth, circling it three times.</p><h4>The 'Mercury Seven'</h4><p>These seven pilots became instant celebrities. They represented American bravery and the idea that the 'New Frontier' of space was conquerable through courage and engineering.</p></div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>Project Apollo: The Moon Shot (1961–1972)</h3><h4>Kennedy’s Challenge</h4><p>In 1961, President John F. Kennedy told Congress that the U.S. should commit to landing a man on the moon before the end of the decade. At the time, NASA didn't even know if it was possible.</p><h4>The Saturn V Rocket</h4><p>To get to the moon, NASA built the Saturn V. It remains the tallest and most powerful rocket ever successfully operated, standing as tall as a 36-story building.</p><h4>Apollo 11 Success</h4><p>On July 20, 1969, Neil Armstrong and Buzz Aldrin landed the 'Eagle' lunar module on the moon. An estimated 650 million people watched the broadcast live as they walked on the lunar surface.</div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>The Impact and Legacy</h3><h4>Technological Boom</h4><p>The push for the moon led to massive jumps in computer technology, solar power, and even common items like water filters and memory foam that we use today.</p><h4>A Global Perspective</h4><p>When astronauts looked back at Earth, they saw a fragile 'Blue Marble' without borders. This changed how people thought about the planet and helped start the environmental movement.</p><h4>The End of the Race</h4><p>The race 'ended' in 1975 with the Apollo-Soyuz mission, where U.S. and Soviet spacecraft docked together in space, signaling a shift from competition to cooperation.</div><h3>Quick Summary</h3><table><tr><th>Event/Mission</th><th>Year</th><th>Key Milestone</th><th>Historical Result</th></tr><tr><td>Sputnik 1</td><td>1957</td><td>First human satellite</td><td>Ignited the Space Race</td></tr><tr><td>NASA Created</td><td>1958</td><td>Civilian space agency</td><td>Organized U.S. efforts</td></tr><tr><td>Alan Shepard Flight</td><td>1961</td><td>First American in space</td><td>Matched Soviet progress</td></tr><tr><td>Apollo 11</td><td>1969</td><td>First Moon landing</td><td>Achieved Kennedy's goal</td></tr></table>"
          }, 
          {
            "title": "The Industrial Revolution",
            "content": "<h2>The Industrial Revolution: Building Modern America</h2><div class='preamble-quote'>The Industrial Revolution was a period of rapid change where hand tools were replaced by power-driven machines and the factory system was born.</div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>From Farms to Factories</h3><p>Before the 1800s, most Americans lived on farms. This changed with the invention of the steam engine. Huge factories began to appear in Northern cities, drawing in thousands of workers looking for steady pay.</p><h4>The Rise of the City</h4><p>Cities like New York and Chicago grew at a pace never seen before. This process is called urbanization. While it brought growth, it also led to overcrowded housing and poor sanitation in working-class neighborhoods.</p></div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>Inventions That Changed Everything</h3><p>Innovation was the heartbeat of this era. Thomas Edison brought light to the world with the incandescent bulb, and Alexander Graham Bell made the world smaller with the telephone.</p><h4>Mass Production</h4><p>Henry Ford changed how we make things by perfecting the assembly line. Instead of one person building an entire car, each person did one small task. This made products cheaper and more accessible to the average family.</p></div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>The Human Cost & Labor Unions</h3><p>Working in a 19th-century factory was dangerous. Children often worked 12-hour days in coal mines or textile mills. There were no safety laws to protect them if they got hurt.</p><h4>The Fight for Rights</h4><p>Workers began to join together to form labor unions. They used strikes (refusing to work) to demand better pay, safer conditions, and the end of child labor. This struggle created the 40-hour work week we have today.</p></div><div class='article-section' style='background:#333; padding:20px; border-radius:10px; margin-bottom:25px;'><h3>A New Global Power</h3><p>By the early 1900s, the United States had transformed from a collection of farming states into the leading industrial power in the world. The era of 'Big Business' had arrived, creating massive wealth for 'Captains of Industry' like Andrew Carnegie and John D. Rockefeller.</p></div><h3>Quick Summary</h3><table><tr><th>Concept</th><th>Impact</th><th>Key Figures</th><th>Outcome</th></tr><tr><td>Urbanization</td><td>Growth of cities</td><td>Working class</td><td>Modern city life</td></tr><tr><td>Assembly Line</td><td>Mass production</td><td>Henry Ford</td><td>Lower costs</td></tr><tr><td>Labor Unions</td><td>Worker rights</td><td>Samuel Gompers</td><td>8-hour workday</td></tr><tr><td>Steam Power</td><td>Faster transport</td><td>James Watt</td><td>Connected nation</td></tr></table>"
          },
          { 
            "title": "The American Revolution",
            "content": "<h2>The American Revolution: The Birth of Liberty</h2><div class='preamble-quote'>The American Revolution was not just a war, but a radical transformation of ideas. It was the moment thirteen colonies decided to challenge the greatest empire on Earth to create a nation founded on the principle that 'all men are created equal.'</div><div class='article-section'><h3>The End of Salutary Neglect</h3><p>For over a century, Britain largely left the colonies alone. This was called 'Salutary Neglect.' But after the expensive French and Indian War, King George III needed money. He turned to the colonies, sparking a decade of tension that would lead to blood.</p><h4>The Stamp Act (1765)</h4><p>This was the first direct tax on the colonists. Every piece of printed paper—legal documents, newspapers, even playing cards—had to carry a tax stamp. The colonists didn't care about the cost as much as the principle: 'No Taxation Without Representation.'</p><h3>Rising Tensions in Boston</h3><p>Boston became the 'Cradle of Liberty' and the center of the resistance. Groups like the Sons of Liberty, led by Samuel Adams, began to organize protests and boycotts of British goods.</p><h4>The Boston Massacre (1770)</h4><p>A tense standoff between a mob of colonists and British soldiers turned deadly. Five colonists were killed. Paul Revere used this event as propaganda, creating an engraving that made it look like a planned slaughter, which turned many neutral colonists against the King.</p><h4>The Boston Tea Party (1773)</h4><p>To protest the Tea Act, colonists disguised themselves and dumped 342 chests of British tea into the harbor. This act of defiance led Britain to pass the 'Intolerable Acts,' which closed the port and put Massachusetts under military rule.</p><h3>The Continental Congress</h3><p>The colonies realized they couldn't fight alone. Leaders from across the land met in Philadelphia to discuss a united response. Men who had never met—like George Washington from Virginia and John Adams from Massachusetts—began to see themselves as 'Americans.'</p><h4>Lexington and Concord (1775)</h4><p>The 'Shot Heard 'Round the World.' British troops marched to seize gunpowder and arrest rebel leaders. At Lexington, a small group of Minutemen stood their ground. By the end of the day, the British were retreating under heavy fire, and the war had officially begun.</p><h3>The Declaration of Independence (1776)</h3><p>Thomas Jefferson was tasked with writing why the colonies were breaking away. He drew on Enlightenment ideas to argue that governments exist only by the 'consent of the governed.' When the delegates signed it, they were committing treason—an act punishable by death.</p><h4>The Philosophy of Freedom</h4><p>Jefferson wrote about 'inalienable rights'—Life, Liberty, and the pursuit of Happiness. This document shifted the war from a rebellion over taxes into a global struggle for human rights.</p><h3>The Long Road to Victory</h3><p>The war was a struggle of endurance. The Continental Army was often hungry, unpaid, and freezing. George Washington's greatest skill was not his strategy, but his ability to keep his army from falling apart.</p><h4>Trenton and Princeton</h4><p>In a desperate move on Christmas night, Washington crossed the icy Delaware River to surprise the Hessians. This victory saved the revolution when it was at its lowest point.</p><h4>Saratoga: The Turning Point</h4><p>The American victory at Saratoga convinced France that the colonies could actually win. King Louis XVI signed a treaty, providing the ships, troops, and money that the Americans desperately needed.</p><h3>The Winter at Valley Forge</h3><p>The winter of 1777-1778 was a test of survival. Thousands died of disease and starvation. However, while they were there, a Prussian officer named Baron von Steuben trained the men, turning a rag-tag group of farmers into a professional fighting force.</p><h3>The Siege of Yorktown (1881)</h3><p>The final major battle took place in Virginia. With the French Navy blocking the sea and Washington’s army surrounding them on land, the British General Cornwallis was forced to surrender. Legend says the British band played 'The World Turned Upside Down.'</p><h3>The Treaty of Paris (1783)</h3><p>Britain officially recognized the United States as an independent nation. The borders were set from the Atlantic Ocean to the Mississippi River. The impossible had happened: the colonies had won.</p><h3>Creating a New Government</h3><p>Winning the war was only half the battle. The first attempt at government, the Articles of Confederation, was too weak. It couldn't collect taxes or raise an army. The country was sliding into chaos.</p><h4>The Constitutional Convention</h4><p>In 1787, the Founders met again to scrap the Articles and write the Constitution. They created a system of 'Checks and Balances' to ensure no single person—like a King—could ever have total power again.</p></div><h3>Quick Summary of the Revolution</h3><table><tr><th>Event</th><th>Year</th><th>Significance</th><th>Result</th></tr><tr><td>Stamp Act</td><td>1765</td><td>Direct taxation</td><td>Unity in protest</td></tr><tr><td>Tea Party</td><td>1773</td><td>Economic protest</td><td>Intolerable Acts</td></tr><tr><td>Lexington</td><td>1775</td><td>First armed conflict</td><td>War begins</td></tr><tr><td>Declaration</td><td>1776</td><td>Formal break</td><td>New nation declared</td></tr><tr><td>Saratoga</td><td>1777</td><td>French Alliance</td><td>Tide turns for US</td></tr><tr><td>Yorktown</td><td>1781</td><td>British surrender</td><td>Fighting ends</td></tr><tr><td>Constitution</td><td>1787</td><td>New framework</td><td>Federal government born</td></tr></table>"
          },
          { "title": "The Voyager Golden Record",
            "content": "<h2>Manual: How to Decode the Golden Record</h2><div class='preamble-quote' style='text-align:center; font-weight:normal; line-height:1.8;'><div style='direction:rtl; font-size:1.5rem; margin-bottom:10px;'>تحياتنا للأصدقاء بين النجوم، يا ليت يجمعنا الزمان</div><div style='font-size:1.1rem; color:#bbb;'>(Greetings to our friends among the stars. We wish time would bring us together)</div></div><div class='article-section'><h3>The Ambassador of the Stars</h3><p>Floating in the silent, infinite dark of the interstellar void is a golden disk that carries the heartbeat of our planet. Launched in 1977, the Voyager Golden Record is more than just a piece of technology; it is humanity’s ultimate legacy. It represents a hopeful reach across the cosmos, intended to survive for billions of years—long after the cities that built it have crumbled into dust. It is our species saying to the universe: 'We were here, and this is what we loved.'</p><h3>Step 1: Finding the 'Hydrogen Clock'</h3><p>Imagine you are an alien. You don't know what a 'second' or a 'minute' is. To help you, NASA drew two circles at the bottom of the cover. This is a Hydrogen atom. When a hydrogen atom state changes, it emits a tiny pulse of energy. This pulse is the 'Universal Tick.' Every other drawing on the cover uses this 'Tick' to tell you how fast to play the record.</p><h4>The Key to Time</h4><p>On the cover, you will see a binary code (dashes and dots). These are not numbers like 1, 2, or 3. They represent multiples of that Hydrogen pulse. This tells the alien: 'Rotate the disk at this specific speed, or the music will sound like high-pitched squeaks!'</p><h3>Step 2: Building the Record Player</h3><p>The record didn't come with a turntable, but it did come with a needle. The drawings in the top left show the disk and the needle in the correct position. If the alien follows the math provided by the Hydrogen Clock, they will know exactly how many times the record should spin per minute (it's roughly 16 and 2/3 revolutions per minute).</p><h4>The Side View</h4><p>There is a drawing of the record from the side. This shows the alien how deep the needle should sit in the grooves. It’s a literal 'How-To' guide for building a record player from scratch using alien technology.</p><h3>Step 3: Turning Sound into Pictures</h3><p>This is the most 'magic' part. The top right of the cover shows a series of staggered lines. This explains that the 'sounds' on the second half of the record are actually images. Each image is made of 512 vertical lines, much like an old analog TV works.</p><h4>The 'Scan' Signal</h4><p>NASA included a specific 'trigger' sound before every picture. If the alien hooks the needle up to a screen instead of a speaker, those sounds will draw lines of light. Line by line, a photo of a mountain, a flower, or a human will appear on their alien monitor.</p><h3>Step 4: Finding the Origin (The Pulsar Map)</h3><p>The large 'starburst' pattern on the left is the map to Earth. It uses 14 pulsars—dead stars that blink with perfect timing, like cosmic lighthouses. Each line shows the direction and the distance from our Sun to that pulsar.</p><h4>The Universal Address</h4><p>Since pulsars slow down at a predictable rate over millions of years, an alien could look at the pulse rates on the record, compare them to the stars they see in the sky, and calculate exactly when the record was launched and where it came from.</p><h3>Step 5: The Content (What's Inside?)</h3><p>Once decoded, the content is divided into four main 'folders' of human history. It is a time capsule meant to represent the best of us, sent out into the cold dark of space.</p><h4>The Gallery of Life</h4><p>There are 116 images. They start with simple math (1+1=2) to make sure the alien understands our logic. Then come pictures of DNA, human anatomy, and how we eat. There are photos of the Great Wall of China, the Taj Mahal, and a simple supermarket.</p><h4>The Symphony of Earth</h4><p>The music spans the globe. It includes 'Johnny B. Goode' by Chuck Berry (Rock and Roll), 'Melancholy Blues' by Louis Armstrong (Jazz), and classical masterpieces. NASA wanted to show that humans are a species that feels deep emotion through rhythm and melody.</p><h4>The Greetings</h4><p>Finally, the record carries voices. It contains a message from the Secretary-General of the UN and a message from President Jimmy Carter, who wrote: 'This is a present from a small, distant world... we are attempting to survive our time so we may live into yours.'</p><h3>Why It Matters</h3><p>The Voyager probes will eventually run out of power and go silent. They will drift forever. The Golden Record is a way for humanity to become immortal. Even if Earth is destroyed by the Sun in five billion years, this record will still be out there, telling the story of a blue planet that once loved, laughed, and made music.</p></div><h3>Quick Summary Table</h3><table><tr><th>Symbol on Cover</th><th>What it Means</th><th>Simple Translation</th></tr><tr><td>Circles with dots</td><td>Hydrogen Atom</td><td>The Universal 'Second'</td></tr><tr><td>Starburst Lines</td><td>Pulsar Map</td><td>The Map to our Sun</td></tr><tr><td>Vertical Rectangles</td><td>Image Waveform</td><td>How to draw pictures</td></tr><tr><td>Binary '1' marks</td><td>Time Units</td><td>The speed of the record</td></tr></table>"
          }          
        ]
      },
      {
        "id": "gr-wr-3",
        "title": "Gr & Wr",
        "moduleTitle": "Grammar and Writing",
        "coefTag": 3,
        "lessons": []
      },
      {
        "id": "tefl-3",
        "title": "TEFL",
        "moduleTitle": "Teaching English as a Foreign Language (TEFL)",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "sp-ph-3",
        "title": "Sp & Ph",
        "moduleTitle": "Speaking and Phonetics",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "ptes-3",
        "title": "PTES",
        "moduleTitle": "Philosophy & Theory of Education System (PTES)",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "brit-am-lit-3",
        "title": "Brit/Am Lit",
        "moduleTitle": "British / American Literature",
        "coefTag": 1,
        "lessons": []
      },
      {
        "id": "ict-3",
        "title": "ICT",
        "moduleTitle": "Information and Communication Technology (ICT)",
        "coefTag": 3,
        "lessons": [
          {
            "title": "//title one goes here",
            "content": "//lesson content goes here"
          },
          {
            "title": "//lesson 2 title goes here",
            "content": "//lesson 2 content goes here"
          },
          {
            "title": "//lesson 3 title goes here",
            "content": "//lesson 3 content goes here"
          },
          {
            "title": "//lesson 4 title goes here",
            "content": "//lesson 4 content goes here"
          },
          {
            "title": "//lesson 5 title goes here",
            "content": "//lesson 5 content goes here"
          },
          {
            "title": "//lesson 6 title goes here",
            "content": "//lesson 6 content goes here"
          }
        ]
      },
      {
        "id": "intro-psycho-3",
        "title": "Intro. Psycho.",
        "moduleTitle": "Introduction to Psychology",
        "coefTag": 4,
        "lessons": [
            {
                "title": "Nature vs. Nurture",
                "content": ""
            }
        ]
      },
      {
        "id": "linguistics-3",
        "title": "Linguistics",
        "moduleTitle": "Linguistics",
        "coefTag": 8,
        "lessons": []
      }
    ]
  },
  
  "4th": {
    "name": "4th Year PEM PES",
    "modules": [
      {
        "id": "psychopeda-4",
        "title": "Psychopeda.",
        "moduleTitle": "Psychopedia",
        "coefTag": 8,
        "lessons": []
      },
      {
        "id": "legislation-4",
        "title": "Legislation R/M",
        "moduleTitle": "Legislation",
        "coefTag": 8,
        "lessons": []
      },
      {
        "id": "brit-am-civ-4",
        "title": "Brit/Am Civ.",
        "moduleTitle": "British / American Civilization",
        "coefTag": 8,
        "lessons": []
      },
      {
        "id": "af-civ-lit-4",
        "title": "Af. Civ/Lit",
        "moduleTitle": "African Civlization & Literature",
        "coefTag": 8,
        "lessons": []
      },
      {
        "id": "tbesd-4",
        "title": "TBESD",
        "moduleTitle": "TBESD (acro)",
        "coefTag": 8,
        "lessons": []
      },
      {
        "id": "app-ling-4",
        "title": "App. Ling.",
        "moduleTitle": "Applied Linguistics",
        "coefTag": 8,
        "lessons": []
      },
      {
        "id": "brit-am-lit-4",
        "title": "Brit/Am Li.",
        "moduleTitle": "British / American Literature",
        "coefTag": 8,
        "lessons": []
      },
      {
        "id": "tefl-4",
        "title": "TEFL",
        "moduleTitle": "Teaching English as a Foreign Language",
        "coefTag": 8,
        "lessons": []
      },
      {
        "id": "mdd-4",
        "title": "MDD",
        "moduleTitle": "MDD (acro)",
        "coefTag": 8,
        "lessons": []
      }
    ]

    },
    
  "5th": {
        "name": "5th Year PES",
        "modules": [
        {
            "id": "issues-5",
            "title": "Issues in C.",
            "moduleTitle": "Issues in C (acro)",
            "coefTag": 0,
            "lessons": []
        },
        {
            "id": "legislation-5",
            "title": "Legislation",
            "moduleTitle": "Legislation",
            "coefTag": 8,
            "lessons": []
        },
        {
            "id": "brit-am-lit-5",
            "title": "Brit/Am Lit.",
            "moduleTitle": "British / American Literature",
            "coefTag": 0,
            "lessons": []
        },
        {
            "id": "app-ling-5",
            "title": "App. Ling.",
            "moduleTitle": "Applied Linguistics",
            "coefTag": 8,
            "lessons": []
        },
        {
            "id": "syll-des-5",
            "title": "Syll. Des.",
            "moduleTitle": "Syll Des (acro)",
            "coefTag": 0,
            "lessons": []
        },
        {
            "id": "brit-am-civ-5",
            "title": "Brit/Am Civ.",
            "moduleTitle": "British / American Civilization",
            "coefTag": 0,
            "lessons": []
        },
        {
            "id": "pedagogy-5",
            "title": "Pedagogy",
            "moduleTitle": "Pedagogy",
            "coefTag": 0,
            "lessons": []
        },
        {
            "id": "af-civ-lit-5",
            "title": "Af. Civ/Lit",
            "moduleTitle": "African Civilization & Literature",
            "coefTag": 0,
            "lessons": []
        }
        ]
    }
}
